PKS1C/src/Reports/ПомесячныйОтчет/ПомесячныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПомесячныйОтчет</name>
</mdclass:Report>

PKS1C/src/InformationRegisters/ПочасовыеРаботы/ПочасовыеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочасовыеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Удаленка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставРабот</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/InformationRegisters/ДоговораОбслуживания/ДоговораОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговораОбслуживания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифСверхурочный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Reports/ПомесячныйОтчет/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана организация",,"Организация");
	Иначе
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	ТабДок.Очистить();

	//Получение всех договоров контаргента с периодами действия
	//ТаблицаДоговоров = ПериодыДоговоровКонтрагента(Организация);
	
	ЗапросРабот = Новый Запрос;
	ЗапросРабот.Текст = 
		"ВЫБРАТЬ
		|	ПочасовыеРаботы.Сверхурочка КАК Сверхурочка,
		|	СУММА(ПочасовыеРаботы.ВремяЗатраты) КАК ВремяЗатраты,
		|	МЕСЯЦ(ПочасовыеРаботы.Период) КАК Месяц,
		|	ГОД(ПочасовыеРаботы.Период) КАК Год
		|ИЗ
		|	РегистрСведений.ПочасовыеРаботы КАК ПочасовыеРаботы
		|ГДЕ
		|	ПочасовыеРаботы.Организация = &Организация
		|	И (ПочасовыеРаботы.Период >= &ПериодНачало
		|	ИЛИ &ПериодНачалоНеУказан)
		|	И (ПочасовыеРаботы.Период <= &ПериодКонец
		|	ИЛИ &ПериодКонецНеУказан)
		|СГРУППИРОВАТЬ ПО
		|	ПочасовыеРаботы.Сверхурочка,
		|	МЕСЯЦ(ПочасовыеРаботы.Период),
		|	ГОД(ПочасовыеРаботы.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Год,
		|	Месяц,
		|	Сверхурочка";
	
	ЗапросРабот.УстановитьПараметр("ПериодНачало", НачалоМесяца(Период.ДатаНачала));
	ЗапросРабот.УстановитьПараметр("ПериодКонец", КонецМесяца(Период.ДатаОкончания));
	ЗапросРабот.УстановитьПараметр("Организация", Организация);
	ЗапросРабот.УстановитьПараметр("ПериодНачалоНеУказан",НЕ ЗначениеЗаполнено(Период.ДатаНачала));
	ЗапросРабот.УстановитьПараметр("ПериодКонецНеУказан",НЕ ЗначениеЗаполнено(Период.ДатаОкончания));	
	
	РезультатЗапросаРабот = ЗапросРабот.Выполнить();	
	ВыборкаРабот = РезультатЗапросаРабот.Выбрать();
	
	ТаблицаСтоимостиРабот = Новый ТаблицаЗначений();
	ТаблицаСтоимостиРабот.Колонки.Добавить("ВремяЗатраты",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,1)));
	ТаблицаСтоимостиРабот.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСтоимостиРабот.Колонки.Добавить("Стоимость",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСтоимостиРабот.Колонки.Добавить("Месяц",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2,0)));
	ТаблицаСтоимостиРабот.Колонки.Добавить("Год",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4,0)));
	
	Пока ВыборкаРабот.Следующий() Цикл
		ВыборкаЦен = ЗапросЦен(Организация,Дата(ВыборкаРабот.Год,ВыборкаРабот.Месяц,1));
		СтрокаРабот = ТаблицаСтоимостиРабот.Добавить();
		СтрокаРабот.Год = ВыборкаРабот.Год;
		СтрокаРабот.Месяц = ВыборкаРабот.Месяц;
		СтрокаРабот.ВремяЗатраты = СтрокаРабот.ВремяЗатраты + ВыборкаРабот.ВремяЗатраты;
		Если ВыборкаРабот.Сверхурочка Тогда
			СтрокаРабот.Стоимость = СтрокаРабот.Стоимость + ВыборкаРабот.ВремяЗатраты * ВыборкаЦен.ТарифСверхурочный; 
		Иначе
			Если ВыборкаЦен.АбонентскаяПлата Тогда
				СтрокаРабот.Стоимость = СтрокаРабот.Стоимость + ВыборкаЦен.Тариф;
			Иначе
				СтрокаРабот.Стоимость = СтрокаРабот.Стоимость + ВыборкаРабот.ВремяЗатраты * ВыборкаЦен.Тариф;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСтоимостиРабот.Свернуть("Год,Месяц","ВремяЗатраты,Стоимость,Цена");
	Для Каждого СтрокаРабот Из ТаблицаСтоимостиРабот Цикл
		СтрокаРабот.Цена = СтрокаРабот.Стоимость / СтрокаРабот.ВремяЗатраты;
	КонецЦикла;
	
	Макет = Отчеты.ПомесячныйОтчет.ПолучитьМакет(Макет);	
	
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");
	
	ОбластьОбщая = Новый ТабличныйДокумент();
	
	НомерВывода = 0;
	
	Для Каждого СтрокаРабот Из ТаблицаСтоимостиРабот Цикл
		ОбластьДанные.Параметры.Часов = СтрокаРабот.ВремяЗатраты;
		ОбластьДанные.Параметры.ЦенаЧаса = СтрокаРабот.Цена;
		ОбластьДанные.Параметры.Сумма = СтрокаРабот.Стоимость;
		ОбластьДанные.Параметры.МесяцГод = ИмяМесяца(СтрокаРабот.Месяц) + " " + Формат(СтрокаРабот.Год,"ЧГ=");		
		ОбластьДанные.Параметры.Дата = Новый Структура("Организация,Период",Организация,Дата(СтрокаРабот.Год,СтрокаРабот.Месяц,1));
		
		Если НомерВывода % 3 = 0 И НомерВывода <> 0 Тогда
			ОбластьОбщая.Вывести(ОбластьДанные);
		Иначе
			ОбластьОбщая.Присоединить(ОбластьДанные);
		КонецЕсли;	
		
		НомерВывода = НомерВывода + 1;
	КонецЦикла;	
	
	ТабДок.Вывести(ОбластьОбщая);
	
	ОбластьДанные.Параметры.Часов = ТаблицаСтоимостиРабот.Итог("ВремяЗатраты");
	ОбластьДанные.Параметры.ЦенаЧаса = ТаблицаСтоимостиРабот.Итог("Стоимость") / ТаблицаСтоимостиРабот.Итог("ВремяЗатраты");
	ОбластьДанные.Параметры.Сумма = ТаблицаСтоимостиРабот.Итог("Стоимость");
	ОбластьДанные.Параметры.МесяцГод = "Итого";
	
	ТабДок.Вывести(ОбластьДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда	
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Отчет.МесячныйОтчет.Форма.ФормаОтчета",Расшифровка,,Новый УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПериодыДоговоровКонтрагента(Организация)
	ЗапросДоговоров = Новый Запрос;
	ЗапросДоговоров.Текст = 
		"ВЫБРАТЬ
		|	ДоговораОбслуживания.Период КАК НачалоДействия,
		|	ДоговораОбслуживания.СрокДействия КАК КонецДействия,
		|	ДоговораОбслуживания.Тариф,
		|	ДоговораОбслуживания.ТарифСверхурочный
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания КАК ДоговораОбслуживания
		|ГДЕ
		|	ДоговораОбслуживания.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
		
	ЗапросДоговоров.УстановитьПараметр("Контрагент",Организация);
	ДатаПостроенияОтчета = ТекущаяДата();
	ТаблицаДоговоров = ЗапросДоговоров.Выполнить().Выгрузить();
	КоличествоДоговоров = ТаблицаДоговоров.Количество();
	Для Индекс = 0 ПО КоличествоДоговоров - 1 Цикл
		ДоговорСтрока = ТаблицаДоговоров[Индекс];
		Если Не ЗначениеЗаполнено(ДоговорСтрока.КонецДействия) Тогда
			Если Индекс < КоличествоДоговоров - 1 Тогда
				ДоговорСтрока.КонецДействия = КонецДня(НачалоДня(ТаблицаДоговоров[Индекс+1].НачалоДействия)-1);
			Иначе
				ДоговорСтрока.КонецДействия = ДатаПостроенияОтчета;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаДоговоров;
КонецФункции

&НаСервереБезКонтекста
Функция ИмяМесяца(НомерМесяца)
	Если НомерМесяца = 1 Тогда
		ИмяМесяца = "Январь";
	ИначеЕсли НомерМесяца = 2 Тогда
		ИмяМесяца = "Февраль";
	ИначеЕсли НомерМесяца = 3 Тогда
		ИмяМесяца = "Март";
	ИначеЕсли НомерМесяца = 4 Тогда
		ИмяМесяца = "Апрель";
	ИначеЕсли НомерМесяца = 5 Тогда
		ИмяМесяца = "Май";
	ИначеЕсли НомерМесяца = 6 Тогда
		ИмяМесяца = "Июнь";
	ИначеЕсли НомерМесяца = 7 Тогда
		ИмяМесяца = "Июль";
	ИначеЕсли НомерМесяца = 8 Тогда
		ИмяМесяца = "Август";
	ИначеЕсли НомерМесяца = 9 Тогда
		ИмяМесяца = "Сентябрь";
	ИначеЕсли НомерМесяца = 10 Тогда
		ИмяМесяца = "Октябрь";
	ИначеЕсли НомерМесяца = 11 Тогда
		ИмяМесяца = "Ноябрь";
	ИначеЕсли НомерМесяца = 12 Тогда
		ИмяМесяца = "Декабрь";
	Иначе
		ИмяМесяца = Неопределено;
	КонецЕсли;
	
	Возврат ИмяМесяца;
КонецФункции
